app/controllers/accidents_controller.rb

SELECT "accidents".* FROM "accidents"
---
  def index
    @accidents = Accident.all

INSERT INTO "accidents" ("time", "accident_type", "created_at", "updated_at", "car_id") VALUES (?, ?, ?, ?, ?)  [["time", "2017-07-09 20:25:00"], ["accident_type", "Headache"], ["created_at", "2017-07-09 20:25:33.850073"], ["updated_at", "2017-07-09 20:25:33.850073"], ["car_id", 1]]
---
  def create
    @accident = Accident.new(accident_params)

    respond_to do |format|
      if @accident.save

UPDATE "accidents" SET "accident_type" = ?, "car_id" = ?, "updated_at" = ? WHERE "accidents"."id" = ?  [["accident_type", "Headache3"], ["car_id", 1], ["updated_at", "2017-07-09 20:25:46.551400"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @accident.update(accident_params)

DELETE FROM "accidents" WHERE "accidents"."id" = ?  [["id", 3]]
---
  def destroy
    @accident.destroy

SELECT  "accidents".* FROM "accidents" WHERE "accidents"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_accident
      @accident = Accident.find(params[:id])