app/controllers/cars_controller.rb

SELECT  "photos".* FROM "photos" WHERE "photos"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    if (@car.photo_id.nil?)
      @photo = Photo.new
    else
      @photo = Photo.find(@car.photo_id)

INSERT INTO "photos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-07-09 19:08:28.281255"], ["updated_at", "2017-07-09 19:08:28.281255"]]
INSERT INTO "cars" ("color", "year", "model", "car_type", "created_at", "updated_at", "photo_id") VALUES (?, ?, ?, ?, ?, ?, ?)  [["color", "White"], ["year", 1996], ["model", "s320"], ["car_type", "Mercedes Benz"], ["created_at", "2017-07-09 19:12:40.507790"], ["updated_at", "2017-07-09 19:12:40.507790"], ["photo_id", 9]]
---
  def create
    @car = Car.new(car_params)
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
        @car.photo_id = @photo.id
        if @car.save

INSERT INTO "photos" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2017-07-09 19:16:21.487581"], ["updated_at", "2017-07-09 19:16:21.487581"]]
UPDATE "cars" SET "photo_id" = ?, "year" = ?, "updated_at" = ? WHERE "cars"."id" = ?  [["photo_id", 13], ["year", 1998], ["updated_at", "2017-07-09 19:17:26.441598"], ["id", 6]]
---
  def update
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save
        @car.photo_id = @photo.id
        if @car.update(car_params)