app/controllers/photos_controller.rb

  def index
    @photos = Photo.order('created_at')
---
SELECT "photos".* FROM "photos" ORDER BY created_at

  def create
    puts "In create photo"
    @photo = Photo.new(photo_params)
    if @photo.save
---
INSERT INTO "photos" ("title", "created_at", "updated_at", "image_file_name", "image_content_type", "image_file_size", "image_updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)