app/views/drivers/_form.html.erb

    <%= form.label :car_id %><br/>
    <%= form.select :car_id, options_for_select(Car.all.map{|s|[s.id.to_s + " " + s.car_type + " " + s.model]}) %>
---
SELECT "cars".* FROM "cars"